ferhatkdz/EDM_Control/bsp_hal/src/bsp_hal_gd32f3x0.c
#include "bsp_hal.h"

extern uint32_t pinmap_merge(uint32_t a, uint32_t b);
extern uint32_t pinmap_peripheral(PinName pin, const PinMap *map);
extern uint32_t pinmap_function(PinName pin, const PinMap *map);
extern uint32_t pinmap_function_ex(PinName pin, uint32_t peripheral, const PinMap *map);
extern uint32_t pinmap_channel(PinName pin, uint32_t peripheral, const PinMap *map);

static UartDataReceivedIRQhandler uartDataReceivedIRQhandler = 0;
static TimerUpdateIRQHandler timerUpdateIRQHandler = 0;
static TimerChannelIRQHandler timerChannelIRQHandler = 0;

static const uint32_t MODES[] = {
	GPIO_MODE_INPUT,
	GPIO_MODE_OUTPUT,
	GPIO_MODE_AF,
	GPIO_MODE_AF,
	GPIO_MODE_ANALOG
};

static const uint32_t PULLS[] = {
	GPIO_PUPD_NONE,
	GPIO_PUPD_PULLUP,
	GPIO_PUPD_PULLDOWN
};

static const uint32_t OUTTYPES[] = {
	GPIO_OTYPE_PP,
	GPIO_OTYPE_OD
};

static const uint32_t AF_TYPES[] = {
	GPIO_AF_0,
	GPIO_AF_1,
	GPIO_AF_2,
	GPIO_AF_3,
	GPIO_AF_4,
	GPIO_AF_5,
	GPIO_AF_6,
	GPIO_AF_7
};

const uint32_t DATABITS[] = {
	USART_WL_8BIT,
	USART_WL_8BIT,
	USART_WL_8BIT,
	USART_WL_8BIT,
	USART_WL_9BIT
};

const uint32_t STOPBITS[] = {
	USART_STB_1BIT,
	USART_STB_0_5BIT,
	USART_STB_2BIT,
	USART_STB_1_5BIT
};

const uint32_t PARITY[] = {
	USART_PM_NONE,
	USART_PM_EVEN,
	USART_PM_ODD
};


const uint32_t TIMER_OC_MODES[] = {
	TIMER_OC_MODE_TIMING,
	TIMER_OC_MODE_ACTIVE,
	TIMER_OC_MODE_INACTIVE,
	TIMER_OC_MODE_TOGGLE,
	TIMER_OC_MODE_LOW,
	TIMER_OC_MODE_HIGH,
	TIMER_OC_MODE_PWM0,
	TIMER_OC_MODE_PWM1
};


const uint32_t TIMER_IC_POLARITIES[] = {
	TIMER_IC_POLARITY_RISING,
	TIMER_IC_POLARITY_FALLING,
	TIMER_IC_POLARITY_BOTH_EDGE
};

const uint32_t TIMER_IC_SELECTION[] = {
	TIMER_IC_SELECTION_DIRECTTI,
	TIMER_IC_SELECTION_INDIRECTTI,
	TIMER_IC_SELECTION_ITS
};

const uint32_t TIMER_IC_TRIGGERS[] = {
	TIMER_SMCFG_TRGSEL_ITI0,
	TIMER_SMCFG_TRGSEL_ITI1,
	TIMER_SMCFG_TRGSEL_ITI2,
	TIMER_SMCFG_TRGSEL_ITI3,
	TIMER_SMCFG_TRGSEL_CI0F_ED,
	TIMER_SMCFG_TRGSEL_CI0FE0,
	TIMER_SMCFG_TRGSEL_CI1FE1,
	TIMER_SMCFG_TRGSEL_ETIFP
};

const uint32_t TIMER_IC_SLAVE_MODES[] = {
	TIMER_SLAVE_MODE_DISABLE,
	TIMER_ENCODER_MODE0,
	TIMER_ENCODER_MODE1,
	TIMER_ENCODER_MODE2,
	TIMER_SLAVE_MODE_RESTART,
	TIMER_SLAVE_MODE_PAUSE,
	TIMER_SLAVE_MODE_EVENT,
	TIMER_SLAVE_MODE_EXTERNAL0
};

const uint32_t INTERRUPTS[] = {
	TIMER_INT_UP,
	TIMER_INT_CH0,
	TIMER_INT_CH1,
	TIMER_INT_CH2,
	TIMER_INT_CH3,
};

const uint32_t INTERRUPT_FLAGS[] = {
	TIMER_INT_FLAG_UP,
	TIMER_INT_FLAG_CH0,
	TIMER_INT_FLAG_CH1,
	TIMER_INT_FLAG_CH2,
	TIMER_INT_FLAG_CH3,
};

static uint32_t gpio_periph_clock_enable(const PinName pin){
	uint8_t port_index = PORT_GET(pin);
	switch(port_index) {
	#if defined(GPIOA)
		case 0:
			rcu_periph_clock_enable(RCU_GPIOA);
			return GPIOA;
	#endif
	#if defined(GPIOB)
		case 1:
			rcu_periph_clock_enable(RCU_GPIOB);
			return GPIOB;
	#endif
	#if defined(GPIOC)
		case 2:
			rcu_periph_clock_enable(RCU_GPIOC);
			return GPIOC;
	#endif
	#if defined(GPIOD)
		case 3:
			rcu_periph_clock_enable(RCU_GPIOD);
			return GPIOD;
	#endif
	#if defined(GPIOE)
		case 4:
			rcu_periph_clock_enable(RCU_GPIOE);
			return GPIOE;
	#endif
	#if defined(GPIOF)
		case 5:
			rcu_periph_clock_enable(RCU_GPIOF);
			return GPIOF;
	#endif
	}
	return 0;
}

static uint32_t uart_periph_clock_enable(const uint8_t index){
	switch(index) {
	#if defined(USART0)
		case 0:
			rcu_periph_clock_enable(RCU_USART0);
			return USART0;
	#endif
	#if defined(USART1)
		case 1:
			rcu_periph_clock_enable(RCU_USART1);
			return USART1;
	#endif
	}
	return 0;
}

static uint32_t timer_periph_clock_enable(const uint8_t index){
	switch(index) {
	#if defined(TIMER0)
		case 0:
			rcu_periph_clock_enable(RCU_TIMER0);
			return TIMER0;
	#endif
	#if defined(TIMER1)
		case 1:
			rcu_periph_clock_enable(RCU_TIMER1);
			return TIMER1;
	#endif
	#if defined(TIMER2)
		case 2:
			rcu_periph_clock_enable(RCU_TIMER2);
			return TIMER2;
	#endif
	#if defined(TIMER5)
		case 5:
			rcu_periph_clock_enable(RCU_TIMER5);
			return TIMER5;
	#endif
	#if defined(TIMER13)
		case 13:
			rcu_periph_clock_enable(RCU_TIMER13);
			return TIMER13;
	#endif
	#if defined(TIMER14)
		case 14:
			rcu_periph_clock_enable(RCU_TIMER14);
			return TIMER14;
	#endif
	#if defined(TIMER15)
		case 15:
			rcu_periph_clock_enable(RCU_TIMER15);
			return TIMER15;
	#endif
	#if defined(TIMER16)
		case 16:
			rcu_periph_clock_enable(RCU_TIMER16);
			return TIMER16;
	#endif
	
	}
	return 0;
}

uint32_t uart_irq_number_get(const uint8_t uart_index) 
{
  uint32_t irq_number = 0;
	
	switch (uart_index) {
			#if defined(USART0)			
			case UART_IND0:
				irq_number = USART0_IRQn;
				break;
			#endif
			#if defined(USART1)			
			case UART_IND1:
				irq_number = USART1_IRQn;
				break;
			#endif
			default:
				break;
	}
	return irq_number;
}

uint32_t timer_irq_number_get(const uint8_t timer_index) 
{
	switch (timer_index) {
	#if defined(TIMER0)
		case 0:
			return TIMER0_BRK_UP_TRG_COM_IRQn;
	#endif
	#if defined(TIMER1)
		case 1:
			return TIMER1_IRQn;
	#endif
	#if defined(TIMER2)
		case 2:
			return TIMER2_IRQn;
	#endif
	#if defined(TIMER5)
		case 5:
			#if defined(GD32F310)
			return TIMER5_DAC_IRQn;
			#elif defined(GD32E23x)
			return TIMER5_IRQn;
			#endif
	#endif
	#if defined(TIMER13)
		case 13:
			return TIMER13_IRQn;
	#endif
	#if defined(TIMER14)
		case 14:
			return TIMER14_IRQn;
	#endif
	#if defined(TIMER15)
		case 15:
			return TIMER15_IRQn;
	#endif
	#if defined(TIMER16)
		case 16:
			return TIMER16_IRQn;
	#endif
	}
	return 0;

}

void bsp_hal_gpio_init(gpio_t * const gpio,const uint8_t initial_pin_state) {
	
		/* GET PERIPHERAL ADDRES & ENABLE RCU_CLOCK */
		gpio->addr = gpio_periph_clock_enable(gpio->pin);
		
		/* GET PIN MASK */
		gpio->mask = 1 << PIN_GET(gpio->pin);
	
		/* SET INITIAL PIN STATE */
		if (initial_pin_state!=2) gpio_bit_write(gpio->addr, gpio->mask, initial_pin_state);
	
		/* SET AF MODE*/
		if ((gpio->mode == HAL_GPIO_MODE_AF_IN) || (gpio->mode == HAL_GPIO_MODE_AF_OUT)) {
			gpio_af_set(gpio->addr, AF_TYPES[gpio->aftype], gpio->mask);
		}
		
