ferhatkdz/EDM_Control/bsp_hal/src/bsp_hal_gd32f3x0.c
		/* SET MODE */
		gpio_mode_set(gpio->addr, MODES[gpio->mode], PULLS[gpio->pull], gpio->mask);
		
		/* SET OUTPUT OPTIONS */
		if (gpio->mode == HAL_GPIO_MODE_AF_OUT) {
			gpio_output_options_set(gpio->addr, OUTTYPES[gpio->outtype],GPIO_OSPEED_50MHZ, gpio->mask);
		}	
}


/* USART PinMap */
const PinMap PinMap_UART_TX[] = {
    {.pin =  PA9, .peripheral = UART_IND0, .function = HAL_GPIO_AF1},
		{.pin =  PA2, .peripheral = UART_IND1, .function = HAL_GPIO_AF1},
    {NC}
};

const PinMap PinMap_UART_RX[] = {
    {.pin = PA10, .peripheral = UART_IND0, .function = HAL_GPIO_AF1},
		{.pin = PA3,  .peripheral = UART_IND1, .function = HAL_GPIO_AF1},
    {NC}
};

void bsp_hal_uart_init(uart_t * const uart) {
	gpio_t rxgpio = {uart->rxpin, HAL_GPIO_MODE_AF_IN, 	HAL_GPIO_PULL_UP, 	HAL_GPIO_OTYPE_NONE};
	gpio_t txgpio = {uart->txpin, HAL_GPIO_MODE_AF_OUT, 	HAL_GPIO_PULL_NONE, HAL_GPIO_OTYPE_PP};
	
	/* GET UART INDEX */
	uart->index = pinmap_merge(pinmap_peripheral(rxgpio.pin, PinMap_UART_RX), pinmap_peripheral(txgpio.pin, PinMap_UART_TX));
	
	/* GET PERIPHERAL ADDRES & ENABLE RCU_CLOCK FOR UART */
	uart->addr = uart_periph_clock_enable(uart->index);
	
	/* GET AF FUNCTIONS */
	rxgpio.aftype = pinmap_function(rxgpio.pin,PinMap_UART_RX);
	txgpio.aftype = pinmap_function(txgpio.pin,PinMap_UART_TX);
	
	/* CONFIGURE RX TX PINS */
	bsp_hal_gpio_init(&rxgpio,2);
	bsp_hal_gpio_init(&txgpio,2);
	
	/* CONFIGURE USART  */
	usart_deinit(uart->addr);
	usart_word_length_set(uart->addr, DATABITS[uart->databits]);
	usart_stop_bit_set(uart->addr, STOPBITS[uart->stopbits]);
	usart_parity_config(uart->addr, PARITY[uart->parity]);
	usart_baudrate_set(uart->addr, uart->baudrate);
	usart_oversample_config(uart->addr,USART_OVSMOD_16);
	usart_overrun_disable(uart->addr);
	usart_receive_config(uart->addr, USART_RECEIVE_ENABLE);
	usart_transmit_config(uart->addr, USART_TRANSMIT_ENABLE);	
}


void bsp_hal_uart_enable_rx_int(uart_t * const uart, const uint8_t priority) {
	bsp_hal_nvic_irq_enable(uart_irq_number_get(uart->index), priority, 0);
	usart_interrupt_enable(uart->addr, USART_INT_RBNE);
}

void bsp_hal_uart_set_rx_irqhandler(UartDataReceivedIRQhandler irqhandler) {
	if (irqhandler != 0) uartDataReceivedIRQhandler = irqhandler;
}

void bsp_hal_uart_transmit(uart_t * const uart, uint8_t * const data, const uint8_t length) {
	for (int i=0; i<length; i++) {
		usart_data_transmit(uart->addr,data[i]);
		while(RESET == usart_flag_get(uart->addr, USART_FLAG_TBE));	
	}
}

void bsp_hal_timer_init(timer_t * const timer) {
	timer_parameter_struct timer_initpara;

	timer->addr = timer_periph_clock_enable(timer->index);
	
	/* deinit a TIMER */
	timer_deinit(timer->addr);
	/* initialize TIMER init parameter struct */
	timer_struct_para_init(&timer_initpara);
	/* TIMER configuration */
	timer_initpara.prescaler         = timer->prescaler;
	timer_initpara.alignedmode       = TIMER_COUNTER_EDGE;
	timer_initpara.counterdirection  = TIMER_COUNTER_UP;
	timer_initpara.period            = timer->period;
	timer_initpara.clockdivision     = TIMER_CKDIV_DIV1;
	timer_init(timer->addr, &timer_initpara);
}


void bsp_hal_timer_enable_int(timer_t * const timer, uint8_t priority) {
	/* clear interrupt bit */
	timer_interrupt_flag_clear(timer->addr, INTERRUPT_FLAGS[timer->interrupt]);
	
	/* enable the TIMER interrupt */
	timer_interrupt_enable(timer->addr, INTERRUPTS[timer->interrupt]);
	
	/* configure the TIMER interrupt */
	bsp_hal_nvic_irq_enable(timer_irq_number_get(timer->index), priority, 0);
}

void bsp_hal_pwm_in_start(pwm_in_t * const pwm_in) {
	timer_t *timer = pwm_in->timer;
	
	/* clear interrupt bit */
	timer_interrupt_flag_clear(timer->addr, INTERRUPT_FLAGS[timer->interrupt]);
	
	/* enable the TIMER interrupt */
	timer_interrupt_enable(timer->addr, INTERRUPTS[timer->interrupt]);
	
	/* start TIMER */
	timer_enable(timer->addr);
}

void bsp_hal_pwm_in_stop(pwm_in_t * const pwm_in) {
	timer_t *timer = pwm_in->timer;
	
	/* disable the TIMER interrupt */
	timer_interrupt_disable(timer->addr, INTERRUPTS[timer->interrupt]);
	
	/* stop TIMER */
	timer_disable(timer->addr);
}


void bsp_hal_timer_set_update_irqhandler(TimerUpdateIRQHandler irqhandler) {
	if (irqhandler != 0) timerUpdateIRQHandler = irqhandler;
}

void bsp_hal_timer_set_channel_irqhandler(TimerChannelIRQHandler irqhandler) {
	if (irqhandler != 0) timerChannelIRQHandler = irqhandler;
}


/* PWM OUT PinMap */
const PinMap PinMap_PWM_OUT[] = {
    {.pin = PA2, 	.peripheral = TIMER_IND14, 	.channel = TIMER_CH_0, .function = HAL_GPIO_AF0},
    
		{.pin = PA3, 	.peripheral = TIMER_IND14, 	.channel = TIMER_CH_1, .function = HAL_GPIO_AF0},
    
		{.pin = PA4, 	.peripheral = TIMER_IND13, 	.channel = TIMER_CH_0, .function = HAL_GPIO_AF4},

    {.pin = PA6, 	.peripheral = TIMER_IND2, 	.channel = TIMER_CH_0, .function = HAL_GPIO_AF1},
    {.pin = PA6, 	.peripheral = TIMER_IND15, 	.channel = TIMER_CH_0, .function = HAL_GPIO_AF5},

    {.pin = PA7, 	.peripheral = TIMER_IND2, 	.channel = TIMER_CH_1, .function = HAL_GPIO_AF1},
    {.pin = PA7, 	.peripheral = TIMER_IND13, 	.channel = TIMER_CH_0, .function = HAL_GPIO_AF4},
    {.pin = PA7, 	.peripheral = TIMER_IND16, 	.channel = TIMER_CH_0, .function = HAL_GPIO_AF5},

    {.pin = PA8, 	.peripheral = TIMER_IND0, 	.channel = TIMER_CH_0, .function = HAL_GPIO_AF2},
    
		{.pin = PA9, 	.peripheral = TIMER_IND0, 	.channel = TIMER_CH_1, .function = HAL_GPIO_AF2},
    
		{.pin = PA10, .peripheral = TIMER_IND0, 	.channel = TIMER_CH_2, .function = HAL_GPIO_AF2},
    
		{.pin = PB0, 	.peripheral = TIMER_IND2, 	.channel = TIMER_CH_2, .function = HAL_GPIO_AF1},
		
		{.pin = PB1, 	.peripheral = TIMER_IND2, 	.channel = TIMER_CH_3, .function = HAL_GPIO_AF1},
    {.pin = PB1, 	.peripheral = TIMER_IND13, 	.channel = TIMER_CH_0, .function = HAL_GPIO_AF0},
		
		{.pin = PB4, 	.peripheral = TIMER_IND2, 	.channel = TIMER_CH_0, .function = HAL_GPIO_AF1},
		
		{.pin = PB5, 	.peripheral = TIMER_IND2, 	.channel = TIMER_CH_1, .function = HAL_GPIO_AF1},
		
