ferhatkdz/EDM_Control/bsp_hal/src/bsp_hal_gd32f3x0.c
		{.pin = PB8, 	.peripheral = TIMER_IND15, 	.channel = TIMER_CH_0, .function = HAL_GPIO_AF2},
		
		{.pin = PB9, 	.peripheral = TIMER_IND16, 	.channel = TIMER_CH_0, .function = HAL_GPIO_AF2},
		
		{.pin = PB14, .peripheral = TIMER_IND14, 	.channel = TIMER_CH_0, .function = HAL_GPIO_AF1},
		
		{.pin = PB15, .peripheral = TIMER_IND14, 	.channel = TIMER_CH_1, .function = HAL_GPIO_AF1},
		
    {NC}
};


void bsp_hal_pwm_out_pin_init(pwm_out_t * const pwm_out) {
	timer_oc_parameter_struct timer_ocinitpara;
	timer_break_parameter_struct timer_breakpara;
	
	timer_t *timer = pwm_out->timer;
	gpio_t gpio = {pwm_out->pin, HAL_GPIO_MODE_AF_OUT, 	HAL_GPIO_PULL_NONE, 	HAL_GPIO_OTYPE_PP};

	/* GET AF FUNCTIONS */
	gpio.aftype = pinmap_function_ex(gpio.pin,timer->index, (PinMap*)&PinMap_PWM_OUT);
	
	/* CONFIGURE GPIO PIN */
	bsp_hal_gpio_init(&gpio,0);

	
	/* GET TIMER CHANNEL */
	pwm_out->channel = pinmap_channel(gpio.pin,timer->index,(PinMap*)&PinMap_PWM_OUT);
	
	/* pwm timer init if needed */
	if (timer->addr == 0) {
		if (timer->period == -1) timer->period = ((SystemCoreClock / (timer->prescaler+1))/timer->pwm_frequency);
		bsp_hal_timer_init(pwm_out->timer);
	}

	pwm_out->duty_mul = (pwm_out->timer->period+1)/100.0f;
	
	/* initialize TIMER channel output parameter struct */
	timer_channel_output_struct_para_init(&timer_ocinitpara);
	/* configure TIMER channel output function */
	timer_ocinitpara.outputstate  = TIMER_CCX_ENABLE;
	timer_ocinitpara.outputnstate = TIMER_CCXN_DISABLE;
	timer_ocinitpara.ocpolarity   = TIMER_OC_POLARITY_HIGH;
	timer_ocinitpara.ocnpolarity  = TIMER_OCN_POLARITY_HIGH;
	timer_ocinitpara.ocidlestate  = TIMER_OC_IDLE_STATE_LOW;
	timer_ocinitpara.ocnidlestate = TIMER_OCN_IDLE_STATE_LOW;		
	
	timer_channel_output_config(timer->addr, pwm_out->channel, &timer_ocinitpara);
  timer_channel_output_pulse_value_config(timer->addr, pwm_out->channel, 0 * pwm_out->duty_mul);
  timer_channel_output_mode_config(timer->addr, pwm_out->channel, TIMER_OC_MODES[pwm_out->mode]);
  timer_channel_output_shadow_config(timer->addr, pwm_out->channel, TIMER_OC_SHADOW_DISABLE);
	
	
	if ((timer->index == 0) || (timer->index == 14) || (timer->index == 15)) {
		timer_break_struct_para_init(&timer_breakpara);
		 /* automatic output enable, break, dead time and lock configuration*/
		timer_breakpara.breakstate       = TIMER_BREAK_DISABLE;
		timer_break_config(timer->addr, &timer_breakpara);
			
		/* primary output function enable */
		timer_primary_output_config(timer->addr, ENABLE);
	}
		
	/* auto-reload preload enable */
  timer_auto_reload_shadow_enable(pwm_out->timer->addr);
		
  /* auto-reload preload enable */
  timer_enable(pwm_out->timer->addr);	
}

void bsp_hal_pwm_start(pwm_out_t * const pwm_out) {
	if (pwm_out->timer->addr == 0) return;
	
	/* auto-reload preload enable */
  timer_auto_reload_shadow_enable(pwm_out->timer->addr);
		
  /* auto-reload preload enable */
  timer_enable(pwm_out->timer->addr);
}

void bsp_hal_pwm_out_pin_set_val(const pwm_out_t* const pwm_out, uint32_t val) {
	if (pwm_out->timer->addr == 0) return;
	
	timer_channel_output_pulse_value_config(pwm_out->timer->addr,  pwm_out->channel,val);
}

void bsp_hal_pwm_out_pin_set_duty(const pwm_out_t* const pwm_out, uint16_t duty) {
	if (pwm_out->timer->addr == 0) return;
	
	timer_channel_output_pulse_value_config(pwm_out->timer->addr,  pwm_out->channel,pwm_out->duty_mul  * duty);
}


void bsp_hal_pwm_in_pin_init(pwm_in_t * const pwm_in) {
	timer_ic_parameter_struct timer_icinitpara;
	
	timer_t *timer = pwm_in->timer;
	
	gpio_t *gpio = &pwm_in->gpio;
	
	gpio->mode = HAL_GPIO_MODE_AF_IN;
	gpio->pull = HAL_GPIO_PULL_NONE;
	
	/* GET AF FUNCTIONS */
	gpio->aftype = pinmap_function_ex(gpio->pin,timer->index, (PinMap*)&PinMap_PWM_OUT);
	
	/* CONFIGURE GPIO PIN */
	bsp_hal_gpio_init(gpio,2);
	
	/* pwm timer init if needed */
	if (timer->addr == 0) {
		if (timer->period == -1) timer->period = ((SystemCoreClock / timer->prescaler)/timer->pwm_frequency)-1;
		bsp_hal_timer_init(pwm_in->timer);
	}
	
	/* initialize TIMER channel input parameter struct */
	timer_channel_input_struct_para_init(&timer_icinitpara);
	/* TIMER CHANNEL PWM input capture configuration */
	timer_icinitpara.icpolarity  = TIMER_IC_POLARITIES[pwm_in->polarity];
	timer_icinitpara.icselection = TIMER_IC_SELECTION_DIRECTTI;
	timer_icinitpara.icprescaler = TIMER_IC_PSC_DIV1;
	timer_icinitpara.icfilter    = 4;

	timer_input_pwm_capture_config(timer->addr, TIMER_CH_0, &timer_icinitpara);
	
	/* channel 0 interrupt disable */
	timer_interrupt_disable(timer->addr, TIMER_INT_CH0);
	/* clear channel 0 interrupt bit */
	timer_interrupt_flag_clear(timer->addr, TIMER_INT_FLAG_CH0);

	/* TIMER counter disable */
	timer_disable(timer->addr);	
}

uint32_t bsp_hal_pwm_in_capture_value_read(pwm_in_t * const pwm_in) {
	return timer_channel_capture_value_register_read(pwm_in->timer->addr,TIMER_CH_0);
}

#if defined(TIMER13)
void TIMER13_IRQHandler(void)
{
    if(SET == timer_interrupt_flag_get(TIMER13, TIMER_INT_FLAG_UP)){
        /* clear update interrupt bit */
        timer_interrupt_flag_clear(TIMER13, TIMER_INT_FLAG_UP);
				/* call timer handler */
				if (timerUpdateIRQHandler != 0) timerUpdateIRQHandler(13);
    }
}
#endif

#if defined(TIMER14)
void TIMER14_IRQHandler(void)
{
    if(SET == timer_interrupt_flag_get(TIMER14, TIMER_INT_FLAG_UP)){
        /* clear update interrupt bit */
        timer_interrupt_flag_clear(TIMER14, TIMER_INT_FLAG_UP);
				/* call timer handler */
				if (timerUpdateIRQHandler != 0) timerUpdateIRQHandler(14);
    }
}
#endif

#if defined(TIMER15)
void TIMER15_IRQHandler(void)
{
    if(SET == timer_interrupt_flag_get(TIMER15, TIMER_INT_FLAG_UP)){
        /* clear update interrupt bit */
        timer_interrupt_flag_clear(TIMER15, TIMER_INT_FLAG_UP);
				/* call timer handler */
				if (timerUpdateIRQHandler != 0) timerUpdateIRQHandler(15);
    }
		
