ferhatkdz/EDM_Control/bsp_hal/src/bsp_hal_gd32f3x0.c
		if(SET == timer_interrupt_flag_get(TIMER15, TIMER_INT_FLAG_CH0)){
        /* clear update interrupt bit */
        timer_interrupt_flag_clear(TIMER15, TIMER_INT_FLAG_CH0);
				/* call timer handler */
				if (timerChannelIRQHandler != 0) timerChannelIRQHandler(15,0);
    }		
}
#endif

#if defined(TIMER16)
void TIMER16_IRQHandler(void)
{
    if(SET == timer_interrupt_flag_get(TIMER16, TIMER_INT_FLAG_UP)){
        /* clear update interrupt bit */
        timer_interrupt_flag_clear(TIMER16, TIMER_INT_FLAG_UP);
				/* call timer handler */
				if (timerUpdateIRQHandler != 0) timerUpdateIRQHandler(16);
    }
}
#endif

#if defined(USART0)
void USART0_IRQHandler(void) 
{		
	if(RESET != usart_interrupt_flag_get(USART0, USART_INT_FLAG_RBNE))
	{
		uint8_t data = usart_data_receive(USART0);
		/* call uart handler */
		if (uartDataReceivedIRQhandler != 0) uartDataReceivedIRQhandler(UART_IND0,data); 
	}
}
#endif

#if defined(USART1)
void USART1_IRQHandler(void) 
{		
	if(RESET != usart_interrupt_flag_get(USART1, USART_INT_FLAG_RBNE))
	{
		uint8_t data = usart_data_receive(USART1);
		/* call uart handler */
		if (uartDataReceivedIRQhandler != 0) uartDataReceivedIRQhandler(UART_IND1,data); 
	}
}
#endif






/* eeprom emulation */


/* Exported constants --------------------------------------------------------*/
/* Page size */



/* Pages 0 and 1 base and end addresses */ 
#define PAGE0_BASE_ADDRESS  (uint32_t)(EEPROM_START_ADDRESS + (uint16_t)0x0000)
#define PAGE0_END_ADDRESS   (uint32_t)(EEPROM_START_ADDRESS + (PAGE_SIZE - 1))

#define PAGE1_BASE_ADDRESS  (uint32_t)(EEPROM_START_ADDRESS + PAGE_SIZE)
#define PAGE1_END_ADDRESS   (uint32_t)(EEPROM_START_ADDRESS + (2 * PAGE_SIZE - 1))


/* Used Flash pages for EEPROM emulation */
#define PAGE0    					0x00
#define PAGE1    					0x01

/* No valid page define */
#define NO_VALID_PAGE    	0xAB

/* Page status definitions */
#define EMPTY_DATA      	(uint32_t)0xFFFFFFFF      /* PAGE is marked to receive data */
#define RECEIVE_DATA      (uint32_t)0xEEEEEEEE      /* PAGE is marked to receive data */
#define VALID_PAGE       	(uint32_t)0x00000000      /* PAGE containing valid data */

/* Valid pages in read and write defines */
#define READ_FROM_VALID_PAGE    (uint8_t)0x00
#define WRITE_IN_VALID_PAGE     (uint8_t)0x01

/* Page full define */
#define PAGE_FULL    (uint8_t)0x80
#define WRITE_ERR    (uint8_t)0x81


/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

/* Global variable used to store variable value in read sequence */
uint16_t DataVar = 0 ;

/* Virtual address defined by the user: 0xFFFF value is prohibited */

extern const uint16_t NumbOfVar; /* Variables' number */
extern const uint16_t VirtAddVarTab[];


/* Private function prototypes -----------------------------------------------*/
extern void    FLASH_PageErase(uint32_t PageAddress);
/* Private functions ---------------------------------------------------------*/
static uint8_t EE_FindValidPage(uint8_t operation);
static uint8_t EE_VerifyPageFullWriteVariable(uint16_t VirtAddress, uint16_t Data);
static uint8_t EE_PageTransfer(uint16_t VirtAddress, uint16_t Data);

/*******************************************************************************
* Function Name  : EE_Format
* Description    : Erases PAGE0 and PAGE1 and writes VALID_PAGE header to PAGE0
* Input          : None
* Output         : None
* Return         : Status of the last operation (Flash write or erase) done during
*                  EEPROM formating
*******************************************************************************/
void EE_Format(void)
{
	/* unlock the flash program/erase controller */
	fmc_unlock();
	
	/* clear all pending flags */
	fmc_flag_clear(FMC_FLAG_END | FMC_FLAG_WPERR | FMC_FLAG_PGERR);
	
	/* erase page 0 */
	fmc_page_erase(PAGE0_BASE_ADDRESS);

	/* clear all pending flags */
	fmc_flag_clear(FMC_FLAG_END | FMC_FLAG_WPERR | FMC_FLAG_PGERR);
	
	/* erase page 1 */
	fmc_page_erase(PAGE1_BASE_ADDRESS);
	
	/* clear all pending flags */
  fmc_flag_clear(FMC_FLAG_END | FMC_FLAG_WPERR | FMC_FLAG_PGERR);

	/* set page0 as valid page word1 */
	fmc_word_program(PAGE0_BASE_ADDRESS, VALID_PAGE);
	
	/* clear all pending flags */
  fmc_flag_clear(FMC_FLAG_END | FMC_FLAG_WPERR | FMC_FLAG_PGERR);
	
	/* set page0 as valid page word2 */
	fmc_word_program(PAGE0_BASE_ADDRESS+4, VALID_PAGE);
	
	/* clear all pending flags */
  fmc_flag_clear(FMC_FLAG_END | FMC_FLAG_WPERR | FMC_FLAG_PGERR);
	
	
  /* lock the main FMC after the operation */
  fmc_lock();
}


/*******************************************************************************
* Function Name  : EE_Format
* Description    : Erases PAGE0 and PAGE1 and writes VALID_PAGE header to PAGE0
* Input          : None
* Output         : None
* Return         : Status of the last operation (Flash write or erase) done during
*                  EEPROM formating
*******************************************************************************/
void EE_Erase(uint32_t PageBaseAddress)
{
	/* clear all pending flags */
	fmc_flag_clear(FMC_FLAG_END | FMC_FLAG_WPERR | FMC_FLAG_PGERR);
	
	/* erase target page */
	fmc_page_erase(PageBaseAddress);
	
	/* clear all pending flags */
  fmc_flag_clear(FMC_FLAG_END | FMC_FLAG_WPERR | FMC_FLAG_PGERR);
}

/*******************************************************************************
* Function Name  : EE_FindValidPage
* Description    : Find valid Page for write or read operation
* Input          : - Operation: operation to achieve on the valid page:
*                      - READ_FROM_VALID_PAGE: read operation from valid page
*                      - WRITE_IN_VALID_PAGE: write operation from valid page
* Output         : None
* Return         : Valid page number (PAGE0 or PAGE1) or NO_VALID_PAGE in case
*                  of no valid page was found
*******************************************************************************/
uint8_t EE_FindValidPage(uint8_t Operation)
{
  uint32_t PageStatus0 = EMPTY_DATA,PageStatus00, PageStatus01;
	uint32_t PageStatus1 = EMPTY_DATA,PageStatus10, PageStatus11;

