ferhatkdz/EDM_Control/bsp_hal/src/bsp_hal_gd32f3x0.c
  /* Get Page0 actual status */
  PageStatus00 = REG32(PAGE0_BASE_ADDRESS);
  PageStatus01 = REG32(PAGE0_BASE_ADDRESS+4);
	if ( (PageStatus00 == VALID_PAGE) &&  (PageStatus01 == VALID_PAGE)) PageStatus0 = VALID_PAGE;
	else if ( (PageStatus00 == VALID_PAGE) &&  (PageStatus01 == EMPTY_DATA)) PageStatus0 = RECEIVE_DATA;
	
  /* Get Page1 actual status */
  PageStatus10 = REG32(PAGE1_BASE_ADDRESS);
  PageStatus11 = REG32(PAGE1_BASE_ADDRESS+4);
	if ( (PageStatus10 == VALID_PAGE) &&  (PageStatus11 == VALID_PAGE)) PageStatus1 = VALID_PAGE;
	else if ( (PageStatus10 == VALID_PAGE) &&  (PageStatus11 == EMPTY_DATA)) PageStatus1 = RECEIVE_DATA;
	

  /* Write or read operation */
  switch (Operation)
  {
    case WRITE_IN_VALID_PAGE:   /* ---- Write operation ---- */
      if (PageStatus1 == VALID_PAGE)
      {
        /* Page0 receiving data */
        if (PageStatus0 == RECEIVE_DATA)
        {
          return PAGE0;   /* Page0 valid */
        }
        else
        {
          return PAGE1;   /* Page1 valid */
        }
      }else if (PageStatus0 == VALID_PAGE)
      {
        /* Page1 receiving data */
        if (PageStatus1 == RECEIVE_DATA)
        {
          return PAGE1;      /* Page1 valid */
        }
        else
        {
          return PAGE0;      /* Page0 valid */
        }
      }
      else
      {
        return NO_VALID_PAGE;   /* No valid Page */
      }

    case READ_FROM_VALID_PAGE:  /* ---- Read operation ---- */
      if (PageStatus0 == VALID_PAGE)
      {
        return PAGE0;           /* Page0 valid */
      }
      else if (PageStatus1 == VALID_PAGE)
      {
        return PAGE1;           /* Page1 valid */
      }
      else
      {
        return NO_VALID_PAGE ;  /* No valid Page */
      }

    default:
      return PAGE0;       /* Page0 valid */
  }
}

/*******************************************************************************
* Function Name  : EE_VerifyPageFullWriteVariable
* Description    : Verify if active page is full and Writes variable in EEPROM.
* Input          : - VirtAddress: 16 bit virtual address of the variable
*                  - Data: 16 bit data to be written as variable value
* Output         : None
* Return         : - Success or error status:
*                      - FLASH_COMPLETE: on success
*                      - PAGE_FULL: if valid page is full
*                      - NO_VALID_PAGE: if no valid page was found
*                      - Flash error code: on write Flash error
*******************************************************************************/
uint8_t EE_VerifyPageFullWriteVariable(uint16_t VirtAddress, uint16_t Data)
{
  fmc_state_enum FlashStatus = FMC_READY;
  uint32_t ValidPage = PAGE0;
  uint32_t Address = 0, PageEndAddress = 0;
	uint32_t wdata;

  /* Get valid Page for write operation */
  ValidPage = EE_FindValidPage(WRITE_IN_VALID_PAGE);

  /* Check if there is no valid page */
  if (ValidPage == NO_VALID_PAGE)
  {
    return  NO_VALID_PAGE;
  }

  /* Get the valid Page start Address */
  Address = (uint32_t)(EEPROM_START_ADDRESS + (uint32_t)(ValidPage * PAGE_SIZE));
	Address += 8;  //skip first 64 bits for page status bytes

  /* Get the valid Page end Address */
  PageEndAddress = (uint32_t)(EEPROM_START_ADDRESS + (uint32_t)((1 + ValidPage) * PAGE_SIZE));

  /* Check each active page address starting from beginning */
  while (Address < PageEndAddress)
  {
    /* Verify if Address and Address+2 contents are 0xFFFFFFFF */
    if ( REG32(Address) == 0xFFFFFFFF)
    {
			wdata = VirtAddress;
			wdata<<=16;
			wdata|=Data;
			
      /* Set variable data */
			FlashStatus = fmc_word_program(Address, wdata);
			fmc_flag_clear(FMC_FLAG_END | FMC_FLAG_WPERR | FMC_FLAG_PGERR);

      /* Return program operation status */
      return FlashStatus;
    }
    else
    {
      /* Next address location */
      Address = Address + 4;
    }
  }

  /* Return PAGE_FULL in case the valid page is full */
  return PAGE_FULL;
}

/*******************************************************************************
* Function Name  : EE_ReadVariable
* Description    : Returns the last stored variable data, if found, which
*                  correspond to the passed virtual address
* Input          : - VirtAddress: Variable virtual address
*                  - Read_data: Global variable contains the read variable value
* Output         : None
* Return         : - Success or error status:
*                      - 0: if variable was found
*                      - 1: if the variable was not found
*                      - NO_VALID_PAGE: if no valid page was found.
*******************************************************************************/
uint8_t EE_ReadVariable(uint16_t VirtAddress, uint16_t* ReadData)
{
  uint32_t ValidPage;
  uint32_t AddressAndValue; 
  uint32_t Address, PageStartAddress;
	uint8_t ReadStatus = 1;

  /* Get active Page for read operation */
  ValidPage = EE_FindValidPage(READ_FROM_VALID_PAGE);

  /* Check if there is no valid page */
  if (ValidPage == NO_VALID_PAGE)
  {
    return  NO_VALID_PAGE;
  }

  /* Get the valid Page start Address */
  PageStartAddress = (uint32_t)(EEPROM_START_ADDRESS + (uint32_t)(ValidPage * PAGE_SIZE));

  /* Get the valid Page end Address */
  Address = (uint32_t)((EEPROM_START_ADDRESS - 4) + (uint32_t)((1 + ValidPage) * PAGE_SIZE)); 
		
  /* Check each active page address starting from end */
  while (Address > (PageStartAddress+4))
  {
    /* Get the current location content to be compared with virtual address */
    AddressAndValue =  REG32(Address);

    /* Compare the read address with the virtual address */
    if (((AddressAndValue>>16) & 0xffff) == VirtAddress)
    {
      /* Get content of Address-2 which is variable value */
      *ReadData = AddressAndValue & 0xffff;
      /* In case variable value is read, reset ReadStatus flag */
      ReadStatus = 0;
      break;
    }
    else
    {
      /* Next address location */
      Address = Address - 4;
    }
  }

  /* Return ReadStatus value: (0: variable exist, 1: variable doesn't exist) */
  return ReadStatus;
}

